app/controllers/notes_controller.rb

    def index
        @notes = Note.all.order("created_at DESC")
---
SELECT "notes".* FROM "notes"  ORDER BY created_at DESC

    def create
        @note = Note.new(note_params)

        if @note.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello "], ["content", "I love my friends"], ["created_at", "2016-05-22 03:11:22.327594"], ["updated_at", "2016-05-22 03:11:22.327594"]]